index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-17 Tue 16:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project Proposal</title>
<meta name="generator" content="Org-mode" />
<link rel="stylesheet" href="css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Project Proposal</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbc63477">Status</a></li>
<li><a href="#orgb0824cf">Intro</a></li>
<li><a href="#orgb553e3c">The Design</a>
<ul>
<li><a href="#org8c1029e">Sub-type Relation</a></li>
<li><a href="#orgbfae8c0">Sum-type</a></li>
<li><a href="#orgcd407cf">Partly Inhabited Record as Type</a></li>
<li><a href="#org71acc97">Naming Convention to make Levels of Universes explicit</a></li>
<li><a href="#org4ccae74">Conclusion</a></li>
</ul>
</li>
<li><a href="#org982f7b5">Examples</a>
<ul>
<li><a href="#org4ef3f67">Functional Programming</a>
<ul>
<li><a href="#org65b57f9">nat-s</a></li>
<li><a href="#orgfdf0b50">nat-add</a></li>
<li><a href="#orga969e60">list-s</a></li>
<li><a href="#orgd7f3d8e">list-length</a></li>
<li><a href="#orgb25e111">list-append</a></li>
<li><a href="#org50248af">list-map</a></li>
</ul>
</li>
<li><a href="#org71c57b9">Logic Programming</a>
<ul>
<li><a href="#orgf1a309c">list-length-s</a></li>
<li><a href="#orgec6384a">list-append-s</a></li>
</ul>
</li>
<li><a href="#org6eb2710">Mathematical Structures</a>
<ul>
<li><a href="#orgcf2e32e">preorder-t</a></li>
<li><a href="#org616826c">eqv-relation-t</a></li>
</ul>
</li>
<li><a href="#orgd7b78e7">Category theory</a>
<ul>
<li><a href="#org88b5189">category-tt</a></li>
<li><a href="#org1105c08">category.isomorphic-t</a></li>
<li><a href="#org4853a08">category.product-t</a></li>
<li><a href="#org798818c">groupoid-t</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org65ec111">A Proposal</a></li>
<li><a href="#orga3aaf61">More</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbc63477" class="outline-2">
<h2 id="orgbc63477">Status</h2>
<div class="outline-text-2" id="text-orgbc63477">
<ul class="org-ul">
<li><p>I am <a href="https://xieyuheng.github.io">Xie Yuheng</a>. I am designing a programming language.</p></li>

<li><p>It might never be perfect, but I've tried very hard to make the design consistent,</p><p>and to clearly expressing what's in my mind.</p></li>

<li><p>I have committed too much of my life to this project.</p><p>I am writing this Project Proposal, because I am hoping to get a second opinion.</p><p><b>If it will be a failure, I wish only I can fail now.</b></p></li></ul>
</div>
</div>

<div id="outline-container-orgb0824cf" class="outline-2">
<h2 id="orgb0824cf">Intro</h2>
<div class="outline-text-2" id="text-orgb0824cf">
<ul class="org-ul">
<li><p>The future of programming language is mathematics.</p></li>

<li><p>Post-CS mathematics will be formalized in programming languages,</p><p>in which mathematical constructions will be tested and debugged,</p><p>and theorems will be proved with the help of the machines.</p></li>

<li><p>The modern mathematical language is category theory.</p></li>

<li><p>Thus I am designing a programming language here,</p><p>of which the main aim is to formalize category theory.</p></li></ul>
</div>
</div>

<div id="outline-container-orgb553e3c" class="outline-2">
<h2 id="orgb553e3c">The Design</h2>
<div class="outline-text-2" id="text-orgb553e3c">
</div><div id="outline-container-org8c1029e" class="outline-3">
<h3 id="org8c1029e">Sub-type Relation</h3>
<div class="outline-text-3" id="text-org8c1029e">
<ul class="org-ul">
<li><p>It is natural to use sub-type relation to model relation between mathematical structures.</p><p>For example :</p><p><ul class="org-ul"></p><p><li><p>equivalent-relation is preorder structure plus symmetric axiom.</p></li></p><p><li><p>groupoid structure is category structure plus one more axiom about inverse of arrow.</p></li></ul></p></li>

<li><p>To achieve this modeling,</p><p>I use inheritable record-type as the main datatype.</p><p>For example :</p><p><ul class="org-ul"></p><p><li><p>eqv-relation-t &lt;: preorder-t</p></li></p><p><li><p>groupoid-t &lt;: category-t</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-orgbfae8c0" class="outline-3">
<h3 id="orgbfae8c0">Sum-type</h3>
<div class="outline-text-3" id="text-orgbfae8c0">
<ul class="org-ul">
<li><p>The use of record-type and the introduction of sub-type,</p><p>will not be in conflict with algebraic datatype.</p></li>

<li><p><p></p><p>On the contrary, when record-type is used uniformly,</p><p>sum-type will be symmetric to sub-type :</p><p></p></p><p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">syntax</th></p><p><th scope="col" class="org-left">semantics</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">:&gt;</td></p><p><td class="org-left">summing sub-types</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&lt;:</td></p><p><td class="org-left">inheriting super-types</td></p><p></tr></p><p></tbody></p><p></table></p></li>

<li><p>For example, list-s can be defined as following :</p></li></ul>

<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB; font-weight: bold;">list-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
list-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB; font-weight: bold;">null-s</span> <span style="color: #7CB8BB; font-weight: bold;">cons-s</span>]
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>

null-s <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
null-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>

cons-s <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
cons-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
  car <span style="color: #DFAF8F;">:</span> t
  cdr <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t)
</pre>
</div>

<ul class="org-ul">
<li><p>list-s is declared as sum-type of null-s and cons-s,</p><p>thus null-s and cons-s must have all the fields of list-s,</p><p>`list-s :&gt; [null-s cons-s]` also means</p><p>`null-s &lt;: list-s` and `cons-s &lt;: list-s`.</p></li></ul>
</div>
</div>

<div id="outline-container-orgcd407cf" class="outline-3">
<h3 id="orgcd407cf">Partly Inhabited Record as Type</h3>
<div class="outline-text-3" id="text-orgcd407cf">
<ul class="org-ul">
<li><p>A type is a partly inhabited record &#x2013; constructed by &lt;name&gt;-s.</p></li>

<li><p>A data is a fully inhabited record &#x2013; constructed by &lt;name&gt;-c.</p></li></ul>

<div class="org-src-container">

<pre class="src src-cicada">list-append <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">--</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t) (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t) <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t)
list-append ante succ <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> ante
    <span style="color: #7CB8BB; font-weight: bold;">null-s</span> succ
    <span style="color: #7CB8BB; font-weight: bold;">cons-s</span> (<span style="color: #DFAF8F;">cons-c</span> ante<span style="color: #BFEBBF;">.car</span> (<span style="color: #7CB8BB; font-weight: bold;">recur</span> ante<span style="color: #BFEBBF;">.cdr</span> succ))
</pre>
</div>

<ul class="org-ul">
<li><p>In the type of `list-append`,</p><p>(list-s t) means the first field of the record list-s</p><p>is inhabited by a value of type `type-t`;</p></li>

<li><p>To construct a data of the type (list-s t),</p><p>we can use (cons-c &lt;car&gt; &lt;cdr&gt;),</p><p>which inhabit the rest of the fields of the record cons-s.</p></li></ul>
</div>
</div>

<div id="outline-container-org71acc97" class="outline-3">
<h3 id="org71acc97">Naming Convention to make Levels of Universes explicit</h3>
<div class="outline-text-3" id="text-org71acc97">
<ul class="org-ul">
<li><p>I also introduced a naming convention to make the level-ness of a type explicit.</p><p>For examples :</p></li></ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">level</th>
<th scope="col" class="org-left">example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">-1</td>
<td class="org-left">zero-c, null-c, cons-c</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">nat-s, list-s, (&#x2013; list-s -&gt; nat-s)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">type-t, category-t</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-left">type-tt, category-t</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4ccae74" class="outline-3">
<h3 id="org4ccae74">Conclusion</h3>
<div class="outline-text-3" id="text-org4ccae74">
<ul class="org-ul">
<li><p>To model mathematical structures</p><p>will be as intuitive as object-oriented programming.</p></li>

<li><p>To prove theorems about mathematical constructions</p><p>will be as intuitive as functional programming.</p></li></ul>
</div>
</div>
</div>
