index.org
***** nat-s

      #+begin_src cicada
      nat-s : type-t
      nat-s = data :> [zero-s succ-s]

      zero-s : type-t
      zero-s = data

      succ-s : type-t
      succ-s = data
        prev : nat-s
      #+end_src

***** nat-add

      #+begin_src cicada
      nat-add : -- nat-s nat-s -> nat-s
      nat-add x y =
        case x
          zero-s y
          succ-s (succ-c (recur x.prev y))
      #+end_src

***** list-s

      #+begin_src cicada
      list-s : type-t
      list-s = data :> [null-s cons-s]
        t : type-t

      null-s : type-t
      null-s = data
        t : type-t

      cons-s : type-t
      cons-s = data
        t : type-t
        car : t
        cdr : (list-s t)
      #+end_src

***** list-length

      #+begin_src cicada
      list-length : -- (list-s t) -> nat-s
      list-length list =
        case list
          null-s zero-c
          cons-s (succ-c (recur list.cdr))
      #+end_src

***** list-append

      #+begin_src cicada
      list-append : -- (list-s t) (list-s t) -> (list-s t)
      list-append ante succ =
        case ante
          null-s succ
          cons-s (cons-c ante.car (recur ante.cdr succ))
      #+end_src

***** list-map

      #+begin_src cicada
      list-map : -- (-- a -> b) (list-s a) -> (list-s b)
      list-map fun list =
        case list
          null-s list
          cons-s (cons-c (fun list.car) (recur fun list.cdr))
      #+end_src

*** Logic Programming

***** list-length-s

      #+begin_src cicada
      list-length-s : type-t
      list-length-s = data :> [zero-length-s succ-length-s]
        list : (list-s t)
        length : nat-s

      zero-length-s : type-t
      zero-length-s = data
        list : (list-s t)
        length : nat-s
        list = null-c
        length = zero-c

      succ-length-s : type-t
      succ-length-s = data
        list : (list-s t)
        length : nat-s
        prev : (list-length-s list length)
        list = (cons-c x list)
        length = (succ-c length)
      #+end_src

***** list-append-s

      #+begin_src cicada
      list-append-s : type-t
      list-append-s = data :> [zero-append-s succ-append-s]
        [ante succ result] : (list-s t)

      zero-append-s : type-t
      zero-append-s = data
        [ante succ result] : (list-s t)
        ante = null-c
        result = succ

      succ-append-s : type-t
      succ-append-s = data
        [ante succ result] : (list-s t)
        prev : (list-append-s cdr succ result-cdr)
        ante = (cons-c car cdr)
        result = (cons-c car result-cdr)
      #+end_src

*** Mathematical Structures

