index.html

<div id="outline-container-org982f7b5" class="outline-2">
<h2 id="org982f7b5">Examples</h2>
<div class="outline-text-2" id="text-org982f7b5">
</div><div id="outline-container-org4ef3f67" class="outline-3">
<h3 id="org4ef3f67">Functional Programming</h3>
<div class="outline-text-3" id="text-org4ef3f67">
</div><div id="outline-container-org65b57f9" class="outline-4">
<h4 id="org65b57f9">nat-s</h4>
<div class="outline-text-4" id="text-org65b57f9">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB; font-weight: bold;">nat-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
nat-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB; font-weight: bold;">zero-s</span> <span style="color: #7CB8BB; font-weight: bold;">succ-s]</span>

<span style="color: #7CB8BB; font-weight: bold;">zero-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
zero-s <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB; font-weight: bold;">data</span>

<span style="color: #7CB8BB; font-weight: bold;">succ-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
succ-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  prev <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">nat-s</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfdf0b50" class="outline-4">
<h4 id="orgfdf0b50">nat-add</h4>
<div class="outline-text-4" id="text-orgfdf0b50">
<div class="org-src-container">

<pre class="src src-cicada">nat-add <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">--</span> <span style="color: #7CB8BB; font-weight: bold;">nat-s</span> <span style="color: #7CB8BB; font-weight: bold;">nat-s</span> <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> <span style="color: #7CB8BB; font-weight: bold;">nat-s</span>
nat-add x y <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> x
    <span style="color: #7CB8BB; font-weight: bold;">zero-s</span> y
    <span style="color: #7CB8BB; font-weight: bold;">succ-s</span> (<span style="color: #DFAF8F;">succ-c</span> (<span style="color: #7CB8BB; font-weight: bold;">recur</span> x<span style="color: #BFEBBF;">.prev</span> y))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga969e60" class="outline-4">
<h4 id="orga969e60">list-s</h4>
<div class="outline-text-4" id="text-orga969e60">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB; font-weight: bold;">list-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
list-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB; font-weight: bold;">null-s</span> <span style="color: #7CB8BB; font-weight: bold;">cons-s</span>]
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>

null-s <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
null-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>

cons-s <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
cons-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
  car <span style="color: #DFAF8F;">:</span> t
  cdr <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7f3d8e" class="outline-4">
<h4 id="orgd7f3d8e">list-length</h4>
<div class="outline-text-4" id="text-orgd7f3d8e">
<div class="org-src-container">

<pre class="src src-cicada">list-length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">--</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t) <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> <span style="color: #7CB8BB; font-weight: bold;">nat-s</span>
list-length list <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> list
    <span style="color: #7CB8BB; font-weight: bold;">null-s</span> <span style="color: #DFAF8F;">zero-c</span>
    <span style="color: #7CB8BB; font-weight: bold;">cons-s</span> (<span style="color: #DFAF8F;">succ-c</span> (<span style="color: #7CB8BB; font-weight: bold;">recur</span> list<span style="color: #BFEBBF;">.cdr</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb25e111" class="outline-4">
<h4 id="orgb25e111">list-append</h4>
<div class="outline-text-4" id="text-orgb25e111">
<div class="org-src-container">

<pre class="src src-cicada">list-append <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">--</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t) (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t) <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t)
list-append ante succ <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> ante
    <span style="color: #7CB8BB; font-weight: bold;">null-s</span> succ
    <span style="color: #7CB8BB; font-weight: bold;">cons-s</span> (<span style="color: #DFAF8F;">cons-c</span> ante<span style="color: #BFEBBF;">.car</span> (<span style="color: #7CB8BB; font-weight: bold;">recur</span> ante<span style="color: #BFEBBF;">.cdr</span> succ))
</pre>
</div>
</div>
</div>

<div id="outline-container-org50248af" class="outline-4">
<h4 id="org50248af">list-map</h4>
<div class="outline-text-4" id="text-org50248af">
<div class="org-src-container">

<pre class="src src-cicada">list-map <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">--</span> (<span style="color: #7CB8BB; font-weight: bold;">--</span> a <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> b) (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> a) <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> b)
list-map fun list <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> list
    <span style="color: #7CB8BB; font-weight: bold;">null-s</span> list
    <span style="color: #7CB8BB; font-weight: bold;">cons-s</span> (<span style="color: #DFAF8F;">cons-c</span> (fun list<span style="color: #BFEBBF;">.car</span>) (<span style="color: #7CB8BB; font-weight: bold;">recur</span> fun list<span style="color: #BFEBBF;">.cdr</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org71c57b9" class="outline-3">
<h3 id="org71c57b9">Logic Programming</h3>
<div class="outline-text-3" id="text-org71c57b9">
</div><div id="outline-container-orgf1a309c" class="outline-4">
<h4 id="orgf1a309c">list-length-s</h4>
<div class="outline-text-4" id="text-orgf1a309c">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB; font-weight: bold;">list-length-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
list-length-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB; font-weight: bold;">zero-length-s</span> <span style="color: #7CB8BB; font-weight: bold;">succ-length-s</span>]
  list <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t)
  length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">nat-s</span>

<span style="color: #7CB8BB; font-weight: bold;">zero-length-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
zero-length-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  list <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t)
  length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">nat-s</span>
  list <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">null-c</span>
  length <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB; font-weight: bold;">zero-c</span>

<span style="color: #7CB8BB; font-weight: bold;">succ-length-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
succ-length-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  list <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t)
  length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">nat-s</span>
  prev <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">list-length-s</span> list length)
  list <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">cons-c</span> x list)
  length <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">succ-c</span> length)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec6384a" class="outline-4">
<h4 id="orgec6384a">list-append-s</h4>
<div class="outline-text-4" id="text-orgec6384a">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB; font-weight: bold;">list-append-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
list-append-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB; font-weight: bold;">zero-append-s</span> <span style="color: #7CB8BB; font-weight: bold;">succ-append-s</span>]
  [ante succ result] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> <span style="color: #7CB8BB; font-weight: bold;">t)</span>

<span style="color: #7CB8BB; font-weight: bold;">zero-append-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
zero-append-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [ante succ result] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t)
  ante <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">null-c</span>
  result <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB; font-weight: bold;">succ</span>

<span style="color: #7CB8BB; font-weight: bold;">succ-append-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>
succ-append-s <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [ante succ result] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">list-s</span> t)
  prev <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">list-append-s</span> cdr succ result-cdr)
  ante <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">cons-c</span> car cdr)
  result <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">cons-c</span> car result-cdr)
</pre>
</div>
</div>
</div>
</div>
