index.org
***** preorder-t

      #+begin_src cicada
      note
        preorder is a thin category
        with at most one morphism from an object to another.

      preorder-t : type-tt
      preorder-t = data
        element-s : type-t

        pre-s :
          -- element-s element-s
          -> type-t

        pre-reflexive :
          -- a :: element-s
          -> (pre-s a a)

        pre-transitive :
          -- (pre-s a b)
             (pre-s b c)
          -> (pre-s a c)
      #+end_src

***** eqv-relation-t

      #+begin_src cicada
      eqv-relation-t : type-tt
      eqv-relation-t = data <: [preorder-t]
        pre-symmetric :
          -- (pre-s a b)
          -> (pre-s b a)
      #+end_src

*** Category theory

***** category-tt

      #+begin_src cicada
      category-tt : type-ttt
      category-tt = data
        object-t : type-tt
        arrow-t : -- object-t object-t -> type-tt
        arrow-eqv-t : -- (arrow-t a b) (arrow-t a b) -> type-tt

        identity : -- a :: object-t -> (arrow-t a a)

        compose : -- (arrow-t a b) (arrow-t b c) -> (arrow-t a c)

        identity-neutral-left :
          -- f : (arrow-t a b)
          -> (arrow-eqv-t f (compose identity f))

        identity-neutral-right :
          -- f : (arrow-t a b)
          -> (arrow-eqv-t f (compose f identity))

        compose-associative :
          -- f : (arrow-t a b)
             g : (arrow-t b c)
             h : (arrow-t c d)
          -> (arrow-eqv-t
               (compose f (compose g h))
               (compose (compose f g) h))

        arrow-eqv-relation :
          -- [a b] :: object-t
          -> (eqv-relation-t
               element-t = (arrow-t a b)
               pre-t = arrow-eqv-t)
      #+end_src

***** category.isomorphic-t

      #+begin_src cicada
      category.isomorphic-t : type-tt
      category.isomorphic-t = data
        [lhs rhs] : object-t
        iso : (arrow-t lhs rhs)
        inv : (arrow-t rhs lhs)
        iso-inv-identity : (arrow-eqv-t (compose iso inv) identity)
        inv-iso-identity : (arrow-eqv-t (compose inv iso) identity)
      #+end_src

***** category.product-t

      #+begin_src cicada
      category.product-candidate-t : type-tt
      category.product-candidate-t = data
        fst : object-t
        snd : object-t
        product : object-t
        fst-projection : (arrow-t product fst)
        snd-projection : (arrow-t product snd)

      category.product-t : type-tt
      category.product-t = data <: [product-candidate-t]
        factorizer :
          -- cand : (product-candidate-t fst snd)
          -> factor : (arrow-t cand.product product)
        unique-factor :
          -- cand : (product-candidate-t fst snd)
          -> unique (factorizer cand)
             of (arrow-t cand.product product)
             under arrow-eqv-t
             such-that
               (arrow-eqv-t
                 cand.fst-projection
                 (compose factor fst-projection))
               (arrow-eqv-t
                 cand.snd-projection
                 (compose factor snd-projection))
      #+end_src

