index.html

<div id="outline-container-org6eb2710" class="outline-3">
<h3 id="org6eb2710">Mathematical Structures</h3>
<div class="outline-text-3" id="text-org6eb2710">
</div><div id="outline-container-orgcf2e32e" class="outline-4">
<h4 id="orgcf2e32e">preorder-t</h4>
<div class="outline-text-4" id="text-orgcf2e32e">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #F0DFAF; font-weight: bold;">note</span>
  preorder is a thin category
  with at most one morphism from an object to another<span style="color: #BFEBBF;">.</span>

<span style="color: #BFEBBF;">preorder-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-tt</span>
<span style="color: #7CB8BB; font-weight: bold;">preorder-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  <span style="color: #7CB8BB; font-weight: bold;">element-s</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>

  <span style="color: #7CB8BB; font-weight: bold;">pre-s</span> <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB; font-weight: bold;">--</span> <span style="color: #7CB8BB; font-weight: bold;">element-s</span> <span style="color: #7CB8BB; font-weight: bold;">element-s</span>
    <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> <span style="color: #7CB8BB; font-weight: bold;">type-t</span>

  pre-reflexive <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB; font-weight: bold;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB; font-weight: bold;">element-s</span>
    <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">pre-s</span> a a)

  pre-transitive <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB; font-weight: bold;">--</span> (<span style="color: #7CB8BB; font-weight: bold;">pre-s</span> a b)
       (<span style="color: #7CB8BB; font-weight: bold;">pre-s</span> b c)
    <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">pre-s</span> a c)
</pre>
</div>
</div>
</div>

<div id="outline-container-org616826c" class="outline-4">
<h4 id="org616826c">eqv-relation-t</h4>
<div class="outline-text-4" id="text-org616826c">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB; font-weight: bold;">eqv-relation-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-tt</span>
<span style="color: #7CB8BB; font-weight: bold;">eqv-relation-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB; font-weight: bold;">preorder-t</span>]
  pre-symmetric <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB; font-weight: bold;">--</span> (<span style="color: #7CB8BB; font-weight: bold;">pre-s</span> a b)
    <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">pre-s</span> b a)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd7b78e7" class="outline-3">
<h3 id="orgd7b78e7">Category theory</h3>
<div class="outline-text-3" id="text-orgd7b78e7">
</div><div id="outline-container-org88b5189" class="outline-4">
<h4 id="org88b5189">category-tt</h4>
<div class="outline-text-4" id="text-org88b5189">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB; font-weight: bold;">category-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-ttt</span>
<span style="color: #7CB8BB; font-weight: bold;">category-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  <span style="color: #7CB8BB; font-weight: bold;">object-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-tt</span>
  <span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">--</span> <span style="color: #7CB8BB; font-weight: bold;">object-t</span> <span style="color: #7CB8BB; font-weight: bold;">object-t</span> <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> <span style="color: #7CB8BB; font-weight: bold;">type-tt</span>
  <span style="color: #7CB8BB; font-weight: bold;">arrow-eqv-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">--</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> a b) (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> a b) <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> <span style="color: #7CB8BB; font-weight: bold;">type-tt</span>

  identity <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB; font-weight: bold;">object-t</span> <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> a a)

  compose <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">--</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> a b) (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> b c) <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> a c)

  identity-neutral-left <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB; font-weight: bold;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> a b)
    <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-eqv-t</span> f (compose identity f))

  identity-neutral-right <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB; font-weight: bold;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> a b)
    <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-eqv-t</span> f (compose f identity))

  compose-associative <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB; font-weight: bold;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> a b)
       g <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> b c)
       h <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> c d)
    <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-eqv-t</span>
         (compose f (compose g h))
         (compose (compose f g) h))

  arrow-eqv-relation <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB; font-weight: bold;">--</span> [a b] <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB; font-weight: bold;">object-t</span>
    <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">eqv-relation-t</span>
         <span style="color: #7CB8BB; font-weight: bold;">element-t</span> <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> a b)
         <span style="color: #7CB8BB; font-weight: bold;">pre-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB; font-weight: bold;">arrow-eqv-t</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1105c08" class="outline-4">
<h4 id="org1105c08">category.isomorphic-t</h4>
<div class="outline-text-4" id="text-org1105c08">
<div class="org-src-container">

<pre class="src src-cicada">category<span style="color: #BFEBBF;">.isomorphic-t</span> <span style="color: #DFAF8F;">:</span> type-tt
category<span style="color: #BFEBBF;">.isomorphic-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [lhs rhs] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">object-t</span>
  iso <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> lhs rhs)
  inv <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> rhs lhs)
  iso-inv-identity <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-eqv-t</span> (compose iso inv) identity)
  inv-iso-identity <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-eqv-t</span> (compose inv iso) identity)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4853a08" class="outline-4">
<h4 id="org4853a08">category.product-t</h4>
<div class="outline-text-4" id="text-org4853a08">
<div class="org-src-container">

<pre class="src src-cicada">category<span style="color: #BFEBBF;">.product-candidate-t</span> <span style="color: #DFAF8F;">:</span> type-tt
category<span style="color: #BFEBBF;">.product-candidate-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  fst <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">object-t</span>
  snd <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">object-t</span>
  product <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">object-t</span>
  fst-projection <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> product fst)
  snd-projection <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> product snd)

category<span style="color: #BFEBBF;">.product-t</span> <span style="color: #DFAF8F;">:</span> type-tt
category<span style="color: #BFEBBF;">.product-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB; font-weight: bold;">product-candidate-t</span>]
  factorizer <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB; font-weight: bold;">--</span> cand <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">product-candidate-t</span> fst snd)
    <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> factor <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> cand<span style="color: #BFEBBF;">.product</span> product)
  unique-factor <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB; font-weight: bold;">--</span> cand <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">product-candidate-t</span> fst snd)
    <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> <span style="color: #F0DFAF; font-weight: bold;">unique</span> (factorizer cand)
       <span style="color: #F0DFAF; font-weight: bold;">of</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-t</span> cand<span style="color: #BFEBBF;">.product</span> product)
       <span style="color: #F0DFAF; font-weight: bold;">under</span> <span style="color: #7CB8BB; font-weight: bold;">arrow-eqv-t</span>
       <span style="color: #F0DFAF; font-weight: bold;">such-that</span>
         (<span style="color: #7CB8BB; font-weight: bold;">arrow-eqv-t</span>
           cand<span style="color: #BFEBBF;">.fst-projection</span>
           (compose factor fst-projection))
         (<span style="color: #7CB8BB; font-weight: bold;">arrow-eqv-t</span>
           cand<span style="color: #BFEBBF;">.snd-projection</span>
           (compose factor snd-projection))
</pre>
</div>
</div>
</div>
