index.org
***** groupoid-t

      #+begin_src cicada
      groupoid-t : type-tt
      groupoid-t = data <: [category-t]
        inverse : -- f : (arrow-s a b) -> (isomorphic-s a b f)
      #+end_src

* A Proposal

  - I wish to defend my design and implementation as PhD thesis,
    because I need a peaceful place to read and write,
    and I wish to talk and learn from people who share the same interests with me.

  - Please contact me if you have any advises. My email -- xyheme@gmail.com

  - I can also ...

* More

  - More informations and examples can be found in the following pages :

    - [[./prelude.html][prelude]] -- Basic mathematical structures.
    - [[./sexp-syntax.html][sexp-syntax]] -- Sexp as intermedium syntax.
    - [[./todo.html][todo]] -- Todo list.
    - [[./topics.html][topics]] -- Other topics to be formalized.

  - [https://github.com/xieyuheng/cicada][source code]
