index.html

<div id="outline-container-org798818c" class="outline-4">
<h4 id="org798818c">groupoid-t</h4>
<div class="outline-text-4" id="text-org798818c">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB; font-weight: bold;">groupoid-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">type-tt</span>
<span style="color: #7CB8BB; font-weight: bold;">groupoid-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB; font-weight: bold;">category-t</span>]
  inverse <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB; font-weight: bold;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB; font-weight: bold;">arrow-s</span> a b) <span style="color: #7CB8BB; font-weight: bold;">-&gt;</span> (<span style="color: #7CB8BB; font-weight: bold;">isomorphic-s</span> a b f)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org65ec111" class="outline-2">
<h2 id="org65ec111">A Proposal</h2>
<div class="outline-text-2" id="text-org65ec111">
<ul class="org-ul">
<li><p>I wish to defend my design and implementation as PhD thesis,</p><p>because I need a peaceful place to read and write,</p><p>and I wish to talk and learn from people who share the same interests with me.</p></li>

<li><p>Please contact me if you have any advises. My email &#x2013; xyheme@gmail.com</p></li>

<li><p>I can also &#x2026;</p></li></ul>
</div>
</div>

<div id="outline-container-orga3aaf61" class="outline-2">
<h2 id="orga3aaf61">More</h2>
<div class="outline-text-2" id="text-orga3aaf61">
<ul class="org-ul">
<li><p>More informations and examples can be found in the following pages :</p><p></p><p><ul class="org-ul"></p><p><li><p><a href="./prelude.html">prelude</a> &#x2013; Basic mathematical structures.</p></li></p><p><li><p><a href="./sexp-syntax.html">sexp-syntax</a> &#x2013; Sexp as intermedium syntax.</p></li></p><p><li><p><a href="./todo.html">todo</a> &#x2013; Todo list.</p></li></p><p><li><p><a href="./topics.html">topics</a> &#x2013; Other topics to be formalized.</p></li></ul></p></li>

<li><p><a href="https://github.com/xieyuheng/cicada">source code</a></p></li></ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-07-17 Tue 16:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
